update after Pavel's feedback
